# #ДЗ часть 1
#
# """
# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.
st = 'as 23 fdfdg544'

l=[]
for num in st:
    if num.isdigit()==True:
        l.append(int(num))
print(l)


# #################################################################################
# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі
s = 'as 23 fdfdg544 34'
lNum=[]
nu=''

# Не могу придумать как сделать так что б в новый масив добавлялось число если оно в конце строки.
# Поэтому добавила в конце букву.
str=s+"b"

for num in str:
    if num.isdigit()==True:
        nu+=num
    if num.isdigit()==False:
        if nu!="":
            lNum.append(int(nu))
            nu=''
        continue

print(lNum)


# #################################################################################
# 3)прога, що виводить кількість кожного символа з введеної строки,
# наприклад:
# #введена строка
#
# 'a' -> 1  #вивело в консолі
# 's' -> 1
# ' ' -> 2
# '2' -> 1
# '3' -> 1
# 'f' -> 2
# 'd' -> 2
# 'g' -> 1
# '5' -> 1
# '4' -> 2
# """
#
string = 'as 23 fdfdg544'
symb=[]
for num in string:
    symb.append(num)

for s in set(symb):
    print(s , '->', int(string.count(s)))
# 2 часть(list comprehension):
#
# 1)есть строка:
greeting = 'Hello, world'
# записать каждый символ в лист поменяв его на верхний регистр
# пример:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
#
world=[]
for s in greeting:
    world.append((s.upper()))
print(world)


# 2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
# пример:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
#
listNum=[]
for i in range(0, 50) :
    if i%2 != 0:
        listNum.append(pow(i,2))
print(listNum)

# 3)  есть лист:
numbers = [1, 2, 3, 4, 5, 6, 7, 8]
# создать новый лист и записать в него 'GT' если элемент в numbers больше 4 и 'LT' если элемент меньше или равен 4
# пример:
# ['LT', 'LT', 'LT', 'LT', 'GT', 'GT', 'GT', 'GT']
symbList=[]
for i in numbers:
    if i>4:
        symbList.append('LT')
    else:
        symbList.append('GT')
print(symbList)

# 4) есть два листа:
list1 = [1, 2, 3, 4, 5]
list2 = [-1, 7, 10, -5, -2]
#
# записать в лист тюплы (x,y) если x+y == 0
# пример:
# [(1, -1), (2, -2), (5, -5)]


# !!!! Нашла как просто обьеденить два списка в один и поместить в такие скобки
# но не знаю как сделать что б оно групировала по условиям

result = [ list(i) for i in zip(list1, list2) ]

print(result)
